Repository: kamilkupcewicz/MathRacer
Catalog: MathGame/MathGame/Strings/*/Resources.resw
Source language: en
Languages: pl, ru

# Icon_Play.Label
source: Play
pl: Gra
ru: Играть

# Icon_Results.Label
source: Results
pl: Wyniki
ru: Результаты

# Icon_Settings.Label
source: Settings
pl: Ustawienia
ru: Настройки

# Icon_Training.Label
source: Training
pl: Nauka
ru: Учёба

# Label_Back.Label
source: Back
pl: Powrót
ru: Назад

# Modes_2_digit.Text
source: Two-digit numbers
pl: Liczby dwucyfrowe
ru: Двузначные числа

# Modes_3_digit.Text
source: Three-digit numbers
pl: Liczby trzycyfrowe
ru: Трёхзначные числа

# Results_Add_2.Text
source: Addition results 2 digits
pl: Dodawanie liczb dwucyfrowych
ru: Сложение двухзначные числа

# Results_Add_3.Text
source: Addition results 3 digits
pl: Dodawanie liczb trzycyfrowych
ru: Сложение трёхзначные числа

# Results_Div_2.Text
source: Division results 2 digits
pl: Dzielenie liczb dwucyfrowych
ru: Деление двузначные числа

# Results_Div_3.Text
source: Division results 3 digits
pl: Dzielenie liczb trzycyfrowych
ru: Деление трёхзначные числа

# Results_Mul_2.Text
source: Multiplication results 2 digits
pl: Mnożenie liczb dwucyfrowych
ru: Умножение двузначные числа

# Results_Mul_3.Text
source: Multiplication results 3 digits
pl: Mnożenie liczb trzycyfrowych
ru: Умножение трёхзначные числа

# Results_Sub_2.Text
source: Subrtaction results 2 digits
pl: Odejmowanie liczb dwucyfrowych
ru: Вычитание двузначные числа

# Results_Sub_3.Text
source: Subrtaction results 3 digits
pl: Odejmowanie liczb trzycyfrowych
ru: Вычитание трёхзначные числа

# Settings_ChangeLanguage.Content
source: Change language
pl: Zmiana języka
ru: Изменить язык

# Settings_Sound.Header
source: Sound
pl: Dźwięk
ru: Звук

# Settings_Sound.OffContent
source: Off
pl: Wyłączony
ru: Выкл.

# Settings_Sound.OnContent
source: On
pl: Włączony
ru: Вкл.

# Settings_Theme.Header
source: Theme choice
pl: Motyw
ru: Выбор темы

# Settings_Theme.OffContent
source: Light
pl: Jasny
ru: Светлая

# Settings_Theme.OnContent
source: Dark
pl: Ciemny
ru: Тёмная

# Textblock_add_2.Text
source: When adding two digit numbers, first add the tens digit C in CD with AB (AB+C0), then add the units digit D to AB+C0
pl: Dodając liczby dwucyfrowe,zacznij od dodania dziesiątek C liczby CD do AB (AB+C0),następnie dodaj jedności D liczby CD do AB+C0
ru: Когда мы сладываем два двузначных числа, сначала добавляем десятичное значение C в CD к AB (AB+C0), затем складываем единичное значение D к AB+C0

# Textblock_add_2_ex.Text
source: To add 64 and 32, first add the tens digit 3 in 32 with 64: 64 + 30 = 94
pl: Aby dodać 64 do 32,zacznij od dodania dziesiątek liczby 32 czyli 3 do 64: 64 + 30 = 94
ru: Чтобы сложить 64 и 32, сначала добавляем десятичное значение 3 в 32 к 64: 64 + 30 = 94

# Textblock_add_2_ex_2.Text
source: Then add the units digit 2 in 32 with 94 to get the sum of 64 and 32: 94 + 2 = 96
pl: Następnie dodaj jedności liczby 32 czyli do 94 aby otrzymać sumę 64 i 32: 94 + 2 = 96
ru: Затем добавляем единичное значение 2 в 32 к 94 чтобы получить значения 64 и 32: 94 + 2 = 96

# Textblock_sub_2.Text
source: When substracting two digit numbers, first substract the digits C in CD from AB (AB-C0), then substract the units digit D from AB-C0
pl: Odejmując liczby dwucyfrowe,zacznij od odjęcia dziesiątek C liczby CD od AB (AB-C0),następnie odejmij jedności D liczby CD od AB-C0
ru: Когда мы вычитаем два двузначных числа, сначала вычитаем десятичное значение C в CD от AB (AB-C0), затем вычитание единичное значение D от AB-C0

# Textblock_sub_2_ex.Text
source: In 79 - 43, first substract the tens digit 4 in 43 from 79: 79 - 40 = 39
pl: Odjemując liczby 79 - 43,zacznij od odjęcia dziesiątek liczby 43 czyli 4 od 79: 79 - 40 = 39
ru: В 79 - 43, сначала вычитаем десятичное значение 4 в 43 от 79: 79 - 40 = 39

# Textblock_sub_2_ex_2.Text
source: Then substract the units digit 3 in 43 from 39: 39 - 3 = 36
pl: Następnie odejmij jedności liczby 43 czyli 3 od 39: 39 - 3 = 36
ru: Затем вычитаем еденичное значение 3 в 43 от 39: 39 - 3 = 36

# Title_Addition.Text
source: Addition
pl: Dodawanie
ru: Сложение

# Title_Addition_modes.Text
source: Addition modes
pl: Tryby Dodawania
ru: Режимы сложение

# Title_Add_section.Text
source: Addition section
pl: Dodawanie
ru: Секция сложения

# Title_Division.Text
source: Division
pl: Dzielenie
ru: Деление

# Title_Division_modes.Text
source: Division modes
pl: Tryby Dzielenia
ru: Режимы деления

# Title_Div_section.Text
source: Division section
pl: Odejmowanie
ru: Секция деления

# Title_Multiplication.Text
source: Multiplication
pl: Mnożenie
ru: Умножение

# Title_Multiplication_modes.Text
source: Multiplication modes
pl: Tryby Mnożenia
ru: Режимы умножения

# Title_Mul_section.Text
source: Multiplication section
pl: Mnożenie
ru: Секция умножения

# Title_Play.Text
source: Play
pl: Gra
ru: Играть

# Title_Results.Text
source: Results
pl: Wyniki
ru: Результаты

# Title_Settings.Text
source: Settings
pl: Ustawienia
ru: Настройки

# Title_Substraction.Text
source: Substraction
pl: Odejmowanie
ru: Вычитания

# Title_Substraction_modes.Text
source: Substraction modes
pl: Tryby Odejmowania
ru: Режимы вычитания

# Title_Sub_section.Text
source: Substraction section
pl: Odejmowanie
ru: Секция вычитания

# Title_Training.Text
source: Training
pl: Nauka
ru: Учёба

# Textblock_mul_2.Text
source: Lets look at a vertical and cross-wise technique that can be used to calculate the product of two digit numbers
pl: Rozważmy dwie techniki mnożenia: w słupku i na krzyż. Metody te posłużą do obliczenia wyniku mnożenia liczb dwucyfrowych.
ru: Рассмотрим две техники множения: вертикально и крест на крест. Эти методики помогут нам в вычислении результата множения двухчисленных цифр.

# Textblock_mul_2_ex.Text
source: To calculate the product of two digit numbers, we will divide the solution into three parts
pl: Aby otrzymać wynik mnożenia liczb dwucyfrowych podzielmy te rozwiąznie na trzy części.
ru: Чтобы получить результат множения двухчисленных цифр мы разделим наше вычисление на 3 части.

# Textblock_mul_2_ex_2.Text
source: Left most part is obtained by multiplying the tens digits 2 in 21 and 3 in 32: 2x3 = 6
pl: Lewa część powstaje jako wynik mnożenia dziesiątek liczby 21 czyli 2 i 32 czyli 3 2*3=6.
ru: Левую часть получаем результатом множения десятка чисел 21, тоесть 2, и 32, тоесть 3 2*3=6.

# Textblock_mul_2_ex_3.Text
source: To calculate the middle part, cross multiply between 2 and 2, and 3 and 1, and then adding the respective values as shown: 2x2 + 3x1= 7
pl: Część środkowa powstaje jako wynik mnożenia liczby 21 i 31 na krzyż tj. 2*2 i 3*1 a następnie dodanie otrzymanych wartości: 2*2 + 3*1 =7.
ru: Среднюю часть получаем результатом множения чисел 21 и 31 крест на крест, тоесть 2*2 и 3*1 а дальше складываем полученные результаты: 2*2 + 3*1 =7.

# Textblock_mul_2_ex_4.Text
source: Rigth most part is obtained by multiplying the digits in units place of both the numbers: 1x2 = 2. Thus we have: 21x32 = 672
pl: Prawa część powstaje jako wynik mnożenia jedności liczby 21 czyli 1 i 32 czyli 2. Stąd 21 * 32=672.
ru: Правую часть получаем результатом множения второй части числа 21, тоесть 1 и 32, тоесть 2. Отсюда 21 * 32=672.
